# AnalysisDisplayColoredSurfaceSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings Class
Members Example See Also
---
Contains colored surface settings for analysis display style element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AnalysisDisplayColoredSurfaceSettings : IDisposable
```

Visual Basic
---
```text
Public Class AnalysisDisplayColoredSurfaceSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalysisDisplayColoredSurfaceSettings : IDisposable
```

# Examples
CopyC#
```text
AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings = new AnalysisDisplayColoredSurfaceSettings();
coloredSurfaceSettings.ShowGridLines = true;
```

CopyVB.NET
```text
Dim coloredSurfaceSettings As New AnalysisDisplayColoredSurfaceSettings()
coloredSurfaceSettings.ShowGridLines = True
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColoredSurfaceSettings
# See Also
AnalysisDisplayColoredSurfaceSettings Members
Autodesk.Revit.DB.Analysis Namespace